/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   draw_map.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mkristie <kukinpower@ya.ru>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/08/12 03:24:11 by mkristie          #+#    #+#             */
/*   Updated: 2020/08/12 03:24:35 by mkristie         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "cub3d.h"

//выделить память под карту четкое количество + 0
//записать карту

void		draw_map(t_game *sv)
{
	int 	i;
	int 	j;

	i = 0;
	j = 0;
//	while (i < sv->map.map_h)
//	{
//		while (j < sv->map.map_w)
//		{
//			if (map[i][j] == '0')
//				continue ;
//		}
//
//	}
}

